app/Controllers/Login.php

    public function login() {
        // Obtiene los datos ingresados por el usuario
        $username="";
        $password="";
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // var_dump( $this->request->getPost());
        $valida = $this->validacion->getRuleGroup('login');
       if(!$this->validate($valida)){
            // var_dump($this->validacion->getErrors());
            session()->setFlashdata(['errores'=>$this->validacion->getErrors()]);
            return redirect()->to('loginInicio')->withInput();

       }



        // Verifica si las credenciales son correctas
        $user = $this->user_model->where('usuario', $username)->where('contraseña', $password)
        ->findAll();
---
SELECT *
FROM `usuarios`
WHERE `usuario` = 'osmar'
AND `contraseña` = 'celaya01'