app/Controllers/productoController.php

SELECT *
FROM `productos`
SELECT `productos`.`id`, `c`.`nombre_c`, `m`.`nombre_m`, `productos`.`nombre`, `productos`.`existencias`
FROM `productos`
JOIN `marcas` `m` ON `productos`.`marca` = `m`.`id`
JOIN `categorias` `c` ON `productos`.`categoria` = `c`.`id`
---
    public function index(){
        $productos = $this->productoModel->findAll();
        $producto = $this->productoModel->select('productos.id, c.nombre_c, m.nombre_m, productos.nombre, productos.existencias')
        ->join('marcas m', 'productos.marca = m.id')
        ->join('categorias c', 'productos.categoria = c.id')->findAll();

SELECT *
FROM `productos`
WHERE `productos`.`id` = '5'
DELETE FROM `productos`
WHERE `id` IN ('5')
---
    public function eliminar($id) {
        $producto = $this->productoModel->find($id);
        if(!!$producto){
            $producto = $this->productoModel->delete($id);